import math
print ("="*50)
print("\t\t WELCOME TO MY SHOP")
print ("="*50)
items = {"tea": 5, "biscut": 10, "litti": 7, "coffy": 20}
# दुकान के सभी समान मुल्य के साथ 
total_price=[]# empaty list यह कार्ट के तरह काम करता है 
while True: # यह infinety loop है यह तब तक चलता रहेगा जब तक युजर N ना डाल दे
  for item, price in items.items():
    print(f"{item} : {price}")
    # यह युजर को सभी समान मूल्य के साथ दिखता है
  ask=input("आप क्या आर्डर करना चाहते हैं: ").lower().strip()


  # यूजर को क्या चाहिए वह यहां पर डालेगा इनपुट मेंलोअर का उसे इसलिए किया गया है ताकि यूजर कैपिटल लेटर में भी दे दे तो प्रोग्राम उसकोस्मॉल लेटर में कर दे स्ट्रिप का उसे इसलिए किया गया है ताकि यूजर स्पेस दे तो प्रोग्राम उसको वहां से हटा दें
  if ask in items:
    qty = int(input("कितना चाहिए: "))
    total_price.append(items[ask] * qty)
    # क्या लूप यह ढूंढता है कि यूजर जो सामान ऑर्डर किया है वह डिक्शनरी में है या नहीं
    print(f"आपने{qty} {ask} pices खरीदा")
  else:# अगर समान डिक्शनरी में नहीं हो तो
    print(f"{ask}  यह प्रोडक्ट दुकान में उपलब्ध नहीं है")
  print(f"\n आप अभी तक जितना सामान ऑर्डर किए हैं उसका कुल रुपया {math.fsum(total_price)} rs है") #यूजर जितना सामान खरीदा है उसका टोटल रुपया कितना है
  ask_continue=input("क्या आप और भी सामान ऑर्डर करना चाहते हैं (answer in [y/n]): ").lower() #यूजर से पूछने के लिए की क्या हुआ और सामान ऑर्डर करना चाहता है या नहीं
  if ask_continue == 'n':
    break #अगर यूजर और सामान नहीं खरीदे तो प्रोग्राम लूप को ब्रेक कर देगा औरफाइनल बिल दिखा देगा
print("-×"*25) #फाइनल बिल
print(f"आपका कुल रुपया  {math.fsum(total_price)} हुआ ")
print("-"*50)
print("मेरे दुकान में आने के लिए धन्यवाद आपका दिन शुभ हो")